# Pyber Challenge

### 4.3 Loading and Reading CSV files

In [1]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

# File to Load (Remember to change these)
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

# Read the City and Ride Data
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

### Merge the DataFrames

In [2]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the data table for preview
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,1/14/2019 10:14,13.83,5.740000e+12,5,Urban
1,South Michelleport,3/4/2019 18:24,30.24,2.340000e+12,72,Urban
2,Port Samanthamouth,2/24/2019 4:29,33.44,2.010000e+12,57,Urban
3,Rodneyfort,2/10/2019 23:22,23.44,5.150000e+12,34,Urban
4,South Jack,3/6/2019 4:28,34.58,3.910000e+12,46,Urban

## Deliverable 1: Get a Summary DataFrame

In [3]:
#  1. Get the total rides for each city type
# Create the city DataFrames.
urban_cities_df = pyber_data_df[pyber_data_df["type"] == "Urban"]
suburban_cities_df = pyber_data_df[pyber_data_df["type"] == "Suburban"]
rural_cities_df = pyber_data_df[pyber_data_df["type"] == "Rural"]

In [4]:
urban_cities_df

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,1/14/2019 10:14,13.83,5.740000e+12,5,Urban
1,South Michelleport,3/4/2019 18:24,30.24,2.340000e+12,72,Urban
2,Port Samanthamouth,2/24/2019 4:29,33.44,2.010000e+12,57,Urban
3,Rodneyfort,2/10/2019 23:22,23.44,5.150000e+12,34,Urban
4,South Jack,3/6/2019 4:28,34.58,3.910000e+12,46,Urban
...,...,...,...,...,...,...
1620,Reynoldsfurt,2/14/2019 11:25,39.40,9.070000e+12,67,Urban
1621,Christopherfurt,3/13/2019 1:47,32.05,2.790000e+12,41,Urban
1622,Raymondhaven,3/20/2019 2:20,38.53,8.660000e+12,11,Urban
1623,Port Johnbury,3/26/2019 7:22,7.63,8.090000e+12,3,Urban
1624,West Gabriel,5/5/2019 1:24,27.57,4.430000e+12,57,Urban

In [5]:
suburban_cities_df

,city,date,fare,ride_id,driver_count,type
1625,Barronchester,1/27/2019 3:08,27.79,6.650000e+12,11,Suburban
1626,East Kentstad,4/7/2019 19:44,18.75,6.580000e+12,20,Suburban
1627,Lake Omar,1/17/2019 21:33,21.71,9.670000e+11,22,Suburban
1628,Myersshire,2/27/2019 17:38,17.10,5.710000e+12,19,Suburban
1629,West Hannah,4/19/2019 1:06,37.78,2.270000e+12,12,Suburban
...,...,...,...,...,...,...
2245,West Hannah,3/2/2019 17:06,13.92,7.390000e+12,12,Suburban
2246,Lake Robertside,4/3/2019 3:27,12.76,1.300000e+12,4,Suburban
2247,Colemanland,1/10/2019 6:49,27.70,8.700000e+12,23,Suburban
2248,East Marymouth,2/12/2019 23:18,47.41,7.410000e+12,5,Suburban
2249,New Raymond,2/11/2019 17:28,17.97,7.550000e+12,17,Suburban

In [6]:
rural_cities_df

,city,date,fare,ride_id,driver_count,type
2250,Randallchester,4/13/2019 11:13,43.22,1.080000e+12,9,Rural
2251,North Holly,2/2/2019 14:54,12.42,1.990000e+12,8,Rural
2252,Michaelberg,3/27/2019 18:27,54.85,4.420000e+12,6,Rural
2253,Lake Latoyabury,2/23/2019 21:12,47.90,3.270000e+12,2,Rural
2254,Lake Latoyabury,5/6/2019 8:57,51.80,4.020000e+12,2,Rural
...,...,...,...,...,...,...
2370,Michaelberg,4/29/2019 17:04,13.38,8.550000e+12,6,Rural
2371,Lake Latoyabury,1/30/2019 0:05,20.76,9.020000e+12,2,Rural
2372,North Jaime,2/10/2019 21:03,11.11,2.780000e+12,1,Rural
2373,West Heather,5/7/2019 19:22,44.94,4.260000e+12,4,Rural
2374,Newtonview,4/25/2019 10:20,55.84,9.990000e+12,1,Rural

In [7]:
# Get the number of rides for urban cities.
urban_ride_count = urban_cities_df.groupby(["city"]).count()["ride_id"]
urban_ride_count = urban_ride_count.sum()
urban_ride_count

1625

In [8]:
# Get the number of rides for suburban cities.
suburban_ride_count = suburban_cities_df.groupby(["city"]).count()["ride_id"]
suburban_ride_count = suburban_ride_count.sum()
suburban_ride_count

625

In [9]:
# Get the number of rides for rural cities.
rural_ride_count = rural_cities_df.groupby(["city"]).count()["ride_id"]
rural_ride_count = rural_ride_count.sum()
rural_ride_count

125

In [34]:
# 2. Get the total drivers for each city type
# Get the number of rides for urban cities.
urban_driver_count = urban_cities_df.groupby(["city"]).mean()["driver_count"]
urban_driver_count = urban_driver_count.sum()
urban_driver_count

2405

In [33]:
# Get the number of rides for suburban cities.
suburban_driver_count = suburban_cities_df.groupby(["city"]).mean()["driver_count"]
suburban_driver_count = suburban_driver_count.sum()
suburban_driver_count

490

In [32]:
# Get the number of rides for rural cities.
rural_driver_count = rural_cities_df.groupby(["city"]).mean()["driver_count"]
rural_driver_count = rural_driver_count.sum()
rural_driver_count

78

In [13]:
#  3. Get the total amount of fares for each city type
# Get the total fare for each urban city.
urban_fare_count = urban_cities_df.groupby(["city"]).sum()["fare"]
urban_fare_count = urban_fare_count.sum()
urban_fare_count

39854.38000000001

In [14]:
# Get the total fare for each suburban city.
suburban_fare_count = suburban_cities_df.groupby(["city"]).sum()["fare"]
suburban_fare_count = suburban_fare_count.sum()
suburban_fare_count

19356.33

In [15]:
# Get the total fare for each rural city.
rural_fare_count = rural_cities_df.groupby(["city"]).sum()["fare"]
rural_fare_count = rural_fare_count.sum()
rural_fare_count

4327.93

In [35]:
#  4. Get the average fare per ride for each city type. 
# Get the average fare per ride for each urban city.
urban_avg_fare_per_ride = (urban_fare_count / urban_ride_count)
urban_avg_fare_per_ride = urban_avg_fare_per_ride.sum()
urban_avg_fare_per_ride

24.525772307692314

In [36]:
# Get the average fare per ride for each suburban city.
suburban_avg_fare_per_ride = (suburban_fare_count / suburban_ride_count)
suburban_avg_fare_per_ride = suburban_avg_fare_per_ride.sum()
suburban_avg_fare_per_ride

30.970128000000003

In [18]:
# Get the average fare per ride for each rural city.
rural_avg_fare_per_ride = (rural_fare_count / rural_ride_count)
rural_avg_fare_per_ride = rural_avg_fare_per_ride.sum()
rural_avg_fare_per_ride

34.62344

In [37]:
# 5. Get the average fare per driver for each city type.
# Get the average fare per driver for each urban city.
avg_urban_fare_per_driver = (urban_fare_count / urban_driver_count)
avg_urban_fare_per_driver

16.57146777546778

In [38]:
# Get the average fare per driver for each suburban city.
avg_suburban_fare_per_driver = (suburban_fare_count / suburban_driver_count)
avg_suburban_fare_per_driver

39.50271428571429

In [39]:
# Get the average fare per driver for each rural city.
avg_rural_fare_per_driver = (rural_fare_count / rural_driver_count)
avg_rural_fare_per_driver

55.48628205128205

In [40]:
#  6. Create a PyBer summary DataFrame. 
pyber_summary_df = pd.DataFrame({"Type": ["Rural", "Suburban", "Urban"],
                    "Total Rides": [rural_ride_count, suburban_ride_count, urban_ride_count],
                    "Total Drivers": [rural_driver_count, suburban_driver_count, urban_driver_count],
                    "Total Fares": [rural_fare_count, suburban_fare_count, urban_fare_count],
                    "Average Fare Per Ride": [rural_avg_fare_per_ride, suburban_avg_fare_per_ride, urban_avg_fare_per_ride],
                    "Average Fare Per Driver": [avg_rural_fare_per_driver, avg_suburban_fare_per_driver, avg_urban_fare_per_driver]}, 
                    columns=["Type", "Total Rides", "Total Drivers", "Total Fares", "Average Fare Per Ride", "Average Fare Per Driver"])
pyber_summary_df

,Type,Total Rides,Total Drivers,Total Fares,Average Fare Per Ride,Average Fare Per Driver
0,Rural,125,78,4327.93,34.623440,55.486282
1,Suburban,625,490,19356.33,30.970128,39.502714
2,Urban,1625,2405,39854.38,24.525772,16.571468

In [41]:
#  7. Cleaning up the DataFrame. Delete the index name
pyber_summary_df.index.name = None
pyber_summary_df

,Type,Total Rides,Total Drivers,Total Fares,Average Fare Per Ride,Average Fare Per Driver
0,Rural,125,78,4327.93,34.623440,55.486282
1,Suburban,625,490,19356.33,30.970128,39.502714
2,Urban,1625,2405,39854.38,24.525772,16.571468

In [42]:
#  8. Format the columns.
pyber_summary_df["Total Rides"] = pyber_summary_df["Total Rides"].map("{:,}".format)
pyber_summary_df["Total Drivers"] = pyber_summary_df["Total Drivers"].map("{:,}".format)
pyber_summary_df["Total Fares"] = pyber_summary_df["Total Fares"].map("${:,.2f}".format)
pyber_summary_df["Average Fare Per Ride"] = pyber_summary_df["Average Fare Per Ride"].map("${:,.2f}".format)
pyber_summary_df["Average Fare Per Driver"] = pyber_summary_df["Average Fare Per Driver"].map("${:,.2f}".format)
pyber_summary_df

,Type,Total Rides,Total Drivers,Total Fares,Average Fare Per Ride,Average Fare Per Driver
0,Rural,125,78,"$4,327.93",$34.62,$55.49
1,Suburban,625,490,"$19,356.33",$30.97,$39.50
2,Urban,"1,625","2,405","$39,854.38",$24.53,$16.57

## Deliverable 2.  Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [68]:
# 1. Read the merged DataFrame
pyber_data_df

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,1/14/2019 10:14,13.83,5.740000e+12,5,Urban
1,South Michelleport,3/4/2019 18:24,30.24,2.340000e+12,72,Urban
2,Port Samanthamouth,2/24/2019 4:29,33.44,2.010000e+12,57,Urban
3,Rodneyfort,2/10/2019 23:22,23.44,5.150000e+12,34,Urban
4,South Jack,3/6/2019 4:28,34.58,3.910000e+12,46,Urban
...,...,...,...,...,...,...
2370,Michaelberg,4/29/2019 17:04,13.38,8.550000e+12,6,Rural
2371,Lake Latoyabury,1/30/2019 0:05,20.76,9.020000e+12,2,Rural
2372,North Jaime,2/10/2019 21:03,11.11,2.780000e+12,1,Rural
2373,West Heather,5/7/2019 19:22,44.94,4.260000e+12,4,Rural
2374,Newtonview,4/25/2019 10:20,55.84,9.990000e+12,1,Rural

In [69]:
# 2. Using groupby() to create a new DataFrame showing the sum of the fares 
#  for each date where the indices are the city type and date.
sum_of_fares_df = pyber_data_df.groupby(["type", "date"]).sum()[["fare"]]
sum_of_fares_df

                        fare
type  date
Rural 1/1/2019 9:45    43.69
      1/11/2019 4:39   16.42
      1/14/2019 15:58  54.10
      1/14/2019 7:09   18.05
      1/15/2019 21:44  30.26
...                      ...
Urban 5/8/2019 1:54    32.69
      5/8/2019 2:31    41.33
      5/8/2019 4:20    21.99
      5/8/2019 4:39    18.45
      5/8/2019 7:29    18.55

[2364 rows x 1 columns]

In [70]:
# 3. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.
# df = df.reset_index()
sum_of_fares_df = df.reset_index()

In [71]:
# 4. Create a pivot table with the 'date' as the index, the columns ='type', and values='fare' 
# to get the total fares for each type of city by the date. 
sum_of_fares_pivot = pd.pivot_table(sum_of_fares_df, values="fare", index=["date"], columns=["type"])
sum_of_fares_pivot

type            Rural  Suburban  Urban
date
1/1/2019 0:08     NaN       NaN  37.91
1/1/2019 0:46     NaN     47.74    NaN
1/1/2019 12:32    NaN     25.56    NaN
1/1/2019 14:40    NaN       NaN   5.42
1/1/2019 14:42    NaN       NaN  12.31
...               ...       ...    ...
5/8/2019 1:54     NaN       NaN  32.69
5/8/2019 2:31     NaN       NaN  41.33
5/8/2019 4:20     NaN       NaN  21.99
5/8/2019 4:39     NaN       NaN  18.45
5/8/2019 7:29     NaN       NaN  18.55

[2361 rows x 3 columns]

In [ ]:
# 5. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2019-01-01':'2019-04-29'.

In [ ]:
# 6. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.
# df.index = pd.to_datetime(df.index)

In [ ]:
# 7. Check that the datatype for the index is datetime using df.info()

In [ ]:
# 8. Create a new DataFrame using the "resample()" function by week 'W' and get the sum of the fares for each week.

In [ ]:
# 8. Using the object-oriented interface method, plot the resample DataFrame using the df.plot() function. 

# Import the style from Matplotlib.
from matplotlib import style
# Use the graph style fivethirtyeight.
style.use('fivethirtyeight')